package com.dome.sdkserver.bq.enumeration;

public enum ErrorCodeEnum {
    appCode为空(2001),
    无效的appCode(2002),
    该应用也经停用(2003),
    有必填参数为空(2004),
    字符串解密失败(2005),
    无效的密码(2006),
    无效的authCode(2007),
    无效的用户名(2008),
    用户名或密码不正确(2009),
    无效的token(2010),
    tonken对应的客户端信息不匹配(2011),
    tonken已经过期(2012),
    获取授权code失败(2013),
    token为空(2014),
    key的长度超过64位(2015),
    设备ID格式错误(2016),
    请求uc失败(2017),
    获取手机短信注册码失败(2018),
    手机短信验证码无效(2019),
    手机号码无效(2020),
    发送手机验证码失败(2021),
    短信验证码发送过于频繁(2022),
    客户端IP格式错误(2023),
    不支持该支付方式(2024),
    无效的计费点(2025),
    手机短信码验证失败(2026),
    新密码和旧密码相同(2027),
    sdk版本号无效(2028),
    绑定冰穹用户ID失败(2029),
    登录验证码输入错误(2030),
    登录过于频繁(2031),
    渠道号错误(2032),
    游戏支付回调地址错误(2033),
    登录类型错误(2034),
    图形验证码标识(2035),
    游客登陆标识(2036),
    邮箱无效(2037),
    邮箱验证码无效(2038),
    获取邮箱注册码失败(2039),
    邮箱验证码验证失败(2040),
    邮箱验证码发送过于频繁(2041),
    邮箱或手机格式不对(2042),
    身份证格式不对(2043),
    非预期错误(9999);


    public final int code;

    private ErrorCodeEnum(int code) {
        this.code = code;
    }
}
